In [1]:
import pandas as pd

In [2]:
df_rank1 = pd.DataFrame({
    "group":["Canopus","Canopus","Canopus","Canopus"],
    "name":["nice nature","double turbo","ikuno taktis","tanhoiza-"],
    "G1_rank":[1,2,3,4],    
    "G2_rank":[1,2,3,4]    
})


df_rank2 = pd.DataFrame({
    "group":["Canopus","Canopus","Canopus","Canopus","supika"],
    "name":["nice nature","double turbo","ikuno taktis","tanhoiza-","special_week"],
    "G1_rank":[1,2,3,4,5] ,   
    "G2_rank":[1,2,3,4,5]    
})

In [3]:
display(df_rank2)

     group          name  G1_rank  G2_rank
0  Canopus   nice nature        1        1
1  Canopus  double turbo        2        2
2  Canopus  ikuno taktis        3        3
3  Canopus     tanhoiza-        4        4
4   supika  special_week        5        5

In [4]:
#s,g = df_rank2[df_rank2["group"] == "Canopus"][["G1_rank","G2_rank"]].mean()

#df_rank2.loc[ df_rank2["group"] == "Canopus", ["G1_rank","G2_rank"]] = [s,g]
#print(s,g)

In [5]:
df_rank2.loc[ df_rank2["group"].str.contains("Canopus") ,["G1_rank","G2_rank"]] = 3
df_rank2

     group          name  G1_rank  G2_rank
0  Canopus   nice nature        3        3
1  Canopus  double turbo        3        3
2  Canopus  ikuno taktis        3        3
3  Canopus     tanhoiza-        3        3
4   supika  special_week        5        5

In [6]:
%%time
for i in range(0,1000):
    df_rank2["group"].unique().shape[0]
    len(df_rank2["group"].unique().tolist())

CPU times: user 176 ms, sys: 0 ns, total: 176 ms
Wall time: 180 ms